{"pageProps":{"post":{"slug":"2023-07-12-principles-of-devops--flow","markdownBody":"\r\n> This post is part of a series called [Principles of DevOps](/posts?tags=PrinciplesOfDevOps).\r\n\r\n\"Flow\" refers to the performance of a system, as opposed to the performance of a specific silo or department.\r\n\r\nIn our daily work, we often only see what's inside our own silo. As a developer, we see requirements come in and code going out. In operations, we see code being pushed to a repository and pipelines deploying it to production. However, it's crucial to understand the flow of work in a broader context.\r\n\r\nMost services or products have a \"value stream\" which describes how work is performed. You can think of the value stream as a carrier belt with multiple work centers. The first work center might be the business department, followed by a design team, a dev team, QA, operations and finally the customer. This structure might look different, depending on what product or service you are building.\r\n\r\n## The flow of work should always go in one direction\r\n\r\nWork is typically generated at some point of the value stream. A requirement by the business department, an issue created by the QA team, an incident in operations, feedback from a customer, and so on.\r\n\r\nRegardless of where the work originates, the flow of work should always go in one direction: forward. Work moving backwards, or even standing still, introduces bottlenecks that prevent downstream work centers from properly working. Always seek to resolve these bottlenecks as soon as possible.\r\n\r\n## Always seek to increase flow\r\n\r\nThe goal of almost any product or service is to bring value to the customer. More work flowing through the system means more value generated. But how do we increase the flow of work?\r\n\r\n**Eliminate work in progress**. This almost always indicates a bottleneck in one of the workcenters. Work should always flow smoothly through the system. If a ticket is stuck in one department for too long, ask why and how this can be avoided in the future.\r\n\r\n**Match the pace of the customer**. If the value stream is pumping out more features than the customer demands, you are not generating value to the business.\r\n\r\n**Reduce work batch size**. By [iterating in small steps](https://garrit.xyz/posts/2023-05-19-work-batch-sizing), you can adapt to changes more quickly. Split up requirements into smaller tickets and increase the amount of deployments.\r\n\r\nIf you want to learn more about how to increase flow in a system, see [theory of constraints](https://en.wikipedia.org/wiki/Theory_of_constraints) and the [Toyota production system](https://hbswk.hbs.edu/item/decoding-the-dna-of-the-toyota-production-system).\r\n\r\n## Never unconsciously pass known defects downstream\r\n\r\nAim to fix problems immedietely as they occur, especially if it's higher up in the value stream. Everyone should be responsible for the work of the entire value stream instead of just their work center.\r\n\r\nIf you notice work or problems being introduced multiple times, it's likely the upstream work center is unaware of this. Immediately seek awareness and work together on resolving it.\r\n\r\n## Never allow local optimization to create global degradation\r\n\r\nOptimizing local work is important, but it should never introduce friction in other workcenters and, by extension, decrease performance of the value stream.\r\n\r\nLocal optimization is often linked to the \"tribal warfare\" between organizations (e.g. development vs. operations, business vs. development, etc.).\r\n\r\n## Conclusion\r\n\r\nUnderstanding and optimizing the flow of work within a value stream is crucial for achieving efficient and effective software delivery. By ensuring that work moves in one direction and continuously seeking to increase the flow, we can generate more value for customers and the business.\r\n\r\nEliminating bottlenecks, matching the pace of the customer, and reducing work batch size are all key strategies to enhance flow. Moreover, actively addressing known defects, promoting collaboration across the value stream, and avoiding local optimizations that hinder overall performance are essential for achieving successful outcomes. By embracing these principles, we can unlock the full potential of DevOps and drive continuous improvement in software delivery processes.\r\n\r\n## Resources\r\n\r\n* [The Three Ways: The Principles Underpinning DevOps](https://itrevolution.com/articles/the-three-ways-principles-underpinning-devops/)\r\n* [Elements Of The First Way: And The DevOps Implications](https://itrevolution.com/articles/elements-of-the-first-way-and-the-devops-implications/)\r\n* [Theory Of Constraints](https://en.wikipedia.org/wiki/Theory_of_constraints)\r\n* [Lean IT](https://en.wikipedia.org/wiki/Lean_IT)\r\n\r\n---\r\n\r\nThis is post 073 of [#100DaysToOffload](https://100daystooffload.com/).\r\n\r\n","frontmatter":{"title":"Principles of DevOps: Flow","date":"2023-07-12","tags":"100DaysToOffload, note, practices, devops, PrinciplesOfDevOps, tech"},"tags":["100DaysToOffload","note","practices","devops","PrinciplesOfDevOps","tech"]},"recommendedPosts":[{"slug":"2024-09-24-installing-mssql-client-drivers-for-a-php-application","frontmatter":{"title":"Installing MSSQL Client Drivers for a PHP Application","date":"2024-09-24","tags":"guide, note, web, tech, programming, php"},"tags":["guide","note","web","tech","programming","php"]},{"slug":"2024-08-31-sentiment-analysis-using-ml-models","frontmatter":{"title":"Sentiment analysis using ML models","date":"2024-08-31","tags":"note, tech, ai"},"tags":["note","tech","ai"]},{"slug":"2024-08-03-how-embedding-models-encode-semantic-meaning","frontmatter":{"title":"How embedding models encode semantic meaning","date":"2024-08-03","tags":"note, tech, math, llm, ai"},"tags":["note","tech","math","llm","ai"]},{"slug":"2024-07-02-linkdump-llms","frontmatter":{"title":"🔗 Linkdump: LLMs","date":"2024-07-02","tags":"note, tech, linkdump, llm, ai"},"tags":["note","tech","linkdump","llm","ai"]},{"slug":"2024-06-27-testing-smtp-connections","frontmatter":{"title":"Testing SMTP connections","date":"2024-06-27","tags":"infrastructure, guide, note, learnings, tech"},"tags":["infrastructure","guide","note","learnings","tech"]}]},"__N_SSG":true}