{"pageProps":{"post":{"slug":"2023-02-14-openssf-best-practices","markdownBody":"\nThe Open Source Security Foundation (OpenSSF) provides [a list of best\npractices](https://bestpractices.coreinfrastructure.org/en/criteria/0) for open\nsource projects. Although this list is tailored towards free and open source\nprojects, I believe that this list is valuable for *all* software projects.\nHere's a breakdown of all practices that I consider generic to all projects, no\nmatter its license, alongside some personal notes.\n\n## Basics\n\n### Basic project website content\n\nThe project website MUST succinctly describe what the software does (what problem does it solve?).\n\n> A website might not always apply, but a README is a good place to put this information.\n\nThe information on how to contribute MUST explain the contribution process (e.g., are pull requests used?)\n\n> This information is also best placed in the README.\n\nThe information on how to contribute SHOULD include the requirements for acceptable contributions (e.g., a reference to any required coding standard)\n\n> -> README.\n\n### Documentation\n\nThe project MUST provide basic documentation for the software produced by the\nproject.\n\nThe project MUST provide reference documentation that describes the external\ninterface (both input and output) of the software produced by the project.\n\n> I wouldn't consider reference documentation a requirement, but it's nice to\nhave.\n\n### Other\n\nThe project sites (website, repository, and download URLs) MUST support HTTPS using TLS.\n\n## Change Control\n\n### Public version-controlled source repository\n\nThe project MUST have a version-controlled source repository ~~that is publicly readable and has a URL~~.\n\nThe project's source repository MUST track what changes were made, who made\nthe changes, and when the changes were made.\n\nTo enable collaborative review, the project's source repository MUST include interim versions for review between releases; it MUST NOT include only final releases.\n\n> In some cases, code can't or shouldn't be versioned. For most website projects,\nreview environments in merge requests (Vercel, Netlify, GitLab) could be\nconsidered.\n\nIt is SUGGESTED that common distributed version control software be used (e.g., git) for the project's source repository.\n\n### Unique version numbering\n\nThe project results MUST have a unique version identifier for each release\nintended to be used by users.\n\n> Commit hashes can be used as unique version numbers in some cases.\n\nIt is SUGGESTED that the Semantic Versioning (SemVer) or Calendar Versioning\n(CalVer) version numbering format be used for releases. It is SUGGESTED that\nthose who use CalVer include a micro level value.\n\n> As mentioned above, projects that are constantly in motion (e.g.\n[darktheme.club](https://darktheme.club/)) might want to consider using commit\nhashes for version numbers instead.\n\nIt is SUGGESTED that projects identify each release within their version\ncontrol system. For example, it is SUGGESTED that those using git identify each\nrelease using git tags.\n\n> Git tags are often neglected during development, but can be very useful.\n\n### Release notes\n\nThe project MUST provide, in each release, release notes that are a\nhuman-readable summary of major changes in that release to help users determine\nif they should upgrade and what the upgrade impact will be. The release notes\nMUST NOT be the raw output of a version control log (e.g., the \"git log\" command\nresults are not release notes). Projects whose results are not intended for\nreuse in multiple locations (such as the software for a single website or\nservice) AND employ continuous delivery MAY select \"N/A\".\n\n> I wrote [a post](/posts/2021-02-20-changelogs) about changelogs a while back.\n\n\nThe release notes MUST identify every publicly known run-time vulnerability\nfixed in this release that already had a CVE assignment or similar when the\nrelease was created. This criterion may be marked as not applicable (N/A) if\nusers typically cannot practically update the software themselves (e.g., as\nis often true for kernel updates). This criterion applies only to the\nproject results, not to its dependencies. If there are no release notes or\nthere have been no publicly known vulnerabilities, choose N/A.\n\n## Reporting\n\n### Vulnerability report process\n\nIf private vulnerability reports are supported, the project MUST include how\nto send the information in a way that is kept private.\n\n> For proprietary projects, it's often a good idea to have a public \"Report an issue\"\nfeature.\n\n## Quality\n\n### Working build system\n\nIf the software produced by the project requires building for use, the\nproject MUST provide a working build system that can automatically rebuild\nthe software from source code.\n\nIt is SUGGESTED that common tools be used for building the software.\n\n### Automated test suite\n\nThe project MUST use at least one automated test suite ~~that is publicly\nreleased as FLOSS (this test suite may be maintained as a separate FLOSS\nproject)~~. The project MUST clearly show or document how to run the test\nsuite(s) (e.g., via a continuous integration (CI) script or via documentation in\nfiles such as BUILD.md, README.md, or CONTRIBUTING.md).\n\nA test suite SHOULD be invocable in a standard way for that language.\n\nE.g. `npm run test`, `cargo test`, etc.\n\nIt is SUGGESTED that the test suite cover most (or ideally all) the code\nbranches, input fields, and functionality.\n\n> Write tests if they are useful, not for the sake of having 100% test coverage.\n\nIt is SUGGESTED that the project implement continuous integration (where new\nor changed code is frequently integrated into a central code repository and\nautomated tests are run on the result).\n\n### New functionality testing\n\nThe project MUST have a general policy (formal or not) that as major new\nfunctionality is added to the software produced by the project, tests of that\nfunctionality should be added to an automated test suite.\n\nThe project MUST have evidence that the test policy for adding tests has been\nadhered to in the most recent major changes to the software produced by the\nproject.\n\n> This is often covered if you have a CI pipeline.\n\nIt is SUGGESTED that this policy on adding tests (see test_policy) be\ndocumented in the instructions for change proposals.\n\n> Consider adding a checkbox to your merge request template. For reference, here's\na checklist that I often use in templates:\n>\n> ```\n> # Checklist:\n>\n> - [ ] documented in the changelog\n> - [ ] sufficiently tested\n> - [ ] sufficiently documented\n> ```\n\n### Warning flags\n\nThe project MUST enable one or more compiler warning flags, a \"safe\"\nlanguage mode, or use a separate \"linter\" tool to look for code quality\nerrors or common simple mistakes, if there is at least one FLOSS tool that\ncan implement this criterion in the selected language.\n\nThe project MUST address warnings.\n\n> Ensure this by disallowing warnings in your CI pipeline.\n\nIt is SUGGESTED that projects be maximally strict with warnings in the\nsoftware produced by the project, where practical.\n\n## Security\n\n### Secure development knowledge\n\nThe project MUST have at least one primary developer who knows how to design\nsecure software.\n\nAt least one of the project's primary developers MUST know of common kinds of\nerrors that lead to vulnerabilities in this kind of software, as well as at\nleast one method to counter or mitigate each of them.\n\n> Easier said than done, but be vocal if you're hesitant towards a feature or\nimplementation path.\n\n### Use basic good cryptographic practices\n\nThe software produced by the project MUST use, by default, only cryptographic\nprotocols and algorithms that are publicly published and reviewed by experts (if\ncryptographic protocols and algorithms are used).\n\nIf the software produced by the project is an application or library, and its\nprimary purpose is not to implement cryptography, then it SHOULD only call on\nsoftware specifically designed to implement cryptographic functions; it SHOULD\nNOT re-implement its own.\n\n> Don't reinvent the wheel. Not just for cryptography.\n\nThe security mechanisms within the software produced by the project MUST use\ndefault keylengths that at least meet the NIST minimum requirements through the\nyear 2030 (as stated in 2012). It MUST be possible to configure the software so\nthat smaller keylengths are completely disabled.\n\nThe default security mechanisms within the software produced by the project\nMUST NOT depend on broken cryptographic algorithms (e.g., MD4, MD5, single DES,\nRC4, Dual_EC_DRBG), or use cipher modes that are inappropriate to the context,\nunless they are necessary to implement an interoperable protocol (where the\nprotocol implemented is the most recent version of that standard broadly\nsupported by the network ecosystem, that ecosystem requires the use of such an\nalgorithm or mode, and that ecosystem does not offer any more secure\nalternative). The documentation MUST describe any relevant security risks and\nany known mitigations if these broken algorithms or modes are necessary for an\ninteroperable protocol.\n\nThe default security mechanisms within the software produced by the project\nSHOULD NOT depend on cryptographic algorithms or modes with known serious\nweaknesses (e.g., the SHA-1 cryptographic hash algorithm or the CBC mode in\nSSH).\n\nThe security mechanisms within the software produced by the project SHOULD\nimplement perfect forward secrecy for key agreement protocols so a session key\nderived from a set of long-term keys cannot be compromised if one of the\nlong-term keys is compromised in the future.\n\nIf the software produced by the project causes the storing of passwords for\nauthentication of external users, the passwords MUST be stored as iterated\nhashes with a per-user salt by using a key stretching (iterated) algorithm\n(e.g., Argon2id, Bcrypt, Scrypt, or PBKDF2). See also OWASP Password Storage\nCheat Sheet).\n\nThe security mechanisms within the software produced by the project MUST\ngenerate all cryptographic keys and nonces using a cryptographically secure\nrandom number generator, and MUST NOT do so using generators that are\ncryptographically insecure.\n\n### Secured delivery against man-in-the-middle (MITM) attacks\n\nThe project MUST use a delivery mechanism that counters MITM attacks. Using\nhttps or ssh+scp is acceptable.\n\nA cryptographic hash (e.g., a sha1sum) MUST NOT be retrieved over http and\nused without checking for a cryptographic signature.\n\n### Publicly known vulnerabilities fixed\n\nThere MUST be no unpatched vulnerabilities of medium or higher severity that\nhave been publicly known for more than 60 days.\n\n> This can be ensured using\n[Dependabot](https://docs.github.com/en/code-security/dependabot/working-with-dependabot)\nor [Renovate](https://docs.renovatebot.com/)\n\nProjects SHOULD fix all critical vulnerabilities rapidly after they are reported.\n\n> Again, use automatic dependency updating mechanisms for this.\n\n### Other security issues\n\nThe public repositories MUST NOT leak a valid private credential (e.g., a\nworking password or private key) that is intended to limit public access.\n\n## Analysis\n\n### Static code analysis\n\nAt least one static code analysis tool (beyond compiler warnings and \"safe\"\nlanguage modes) MUST be applied to any proposed major production release of the\nsoftware before its release, if there is at least one ~~FLOSS~~ tool that implements\nthis criterion in the selected language.\n\nIt is SUGGESTED that at least one of the static analysis tools used for the\nstatic_analysis criterion include rules or approaches to look for common\nvulnerabilities in the analyzed language or environment.\n\nAll medium and higher severity exploitable vulnerabilities discovered with\nstatic code analysis MUST be fixed in a timely way after they are confirmed.\n\nIt is SUGGESTED that static source code analysis occur on every commit or at\nleast daily.\n\n### Dynamic code analysis\n\nIt is SUGGESTED that at least one dynamic analysis tool be applied to any\nproposed major production release of the software before its release.\n\nIt is SUGGESTED that if the software produced by the project includes\nsoftware written using a memory-unsafe language (e.g., C or C++), then at\nleast one dynamic tool (e.g., a fuzzer or web application scanner) be\nroutinely used in combination with a mechanism to detect memory safety\nproblems such as buffer overwrites.\n\n> This is often overlooked.\n\nIt is SUGGESTED that the project use a configuration for at least some dynamic\nanalysis (such as testing or fuzzing) which enables many assertions. In many\ncases these assertions should not be enabled in production builds.\n\nAll medium and higher severity exploitable vulnerabilities discovered with\ndynamic code analysis MUST be fixed in a timely way after they are confirmed.\n\n---\n\nThis is post 046 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"OpenSSF Best Practices","date":"2023-02-14","tags":"note, 100DaysToOffload, practices, tech"},"tags":["note","100DaysToOffload","practices","tech"]},"recommendedPosts":[{"slug":"2026-02-13-n8n-nodes-open5e-n8n-community-node-that-lets-you-access-d-d-5th-edition-srd-content","frontmatter":{"title":"n8n-nodes-open5e: n8n community node that lets you access D&D 5th edition SRD content","date":"2026-02-13","tags":"note, tech, programming, n8n, automation, ttrpg"},"tags":["note","tech","programming","n8n","automation","ttrpg"]},{"slug":"2026-02-04-a-fix-for-long-pressing-movement-keys-in-vscode-with-vim-mode","frontmatter":{"title":"A fix for long-pressing movement keys in VSCode with Vim-Mode","date":"2026-02-04","tags":"guide, note, editors, tech, programming"},"tags":["guide","note","editors","tech","programming"]},{"slug":"2026-02-03-the-scientific-method","frontmatter":{"title":"The Scientific Method","date":"2026-02-03","tags":"note, practices, life, science"},"tags":["note","practices","life","science"]},{"slug":"2026-02-02-the-cult-of-done-manifesto","frontmatter":{"title":"The Cult of Done Manifesto","date":"2026-02-02","tags":"note, practices, writing, life, quote"},"tags":["note","practices","writing","life","quote"]},{"slug":"2025-12-11-custom-entities-in-home-assistant","frontmatter":{"title":"Custom Entities in Home Assistant","date":"2025-12-11","tags":"guide, note, homeassistant, homelab, tech, programming"},"tags":["guide","note","homeassistant","homelab","tech","programming"]}]},"__N_SSG":true}