{"pageProps":{"post":{"slug":"2023-07-11-principles-of-devops-introduction","markdownBody":"\r\nI recently changed roles in my company, and I can officially call myself a \"DevOps Engineer\" now. But what does that really mean?\r\n\r\nIn an attempt to write down my thoughts about this topic, I'm starting a series of blog posts called \"Principles of DevOps\". I'm usually very bad at sticking to things, so I'm curious to see if this series will lead anywhere.\r\n\r\nTo collect the posts of this series, I created a tag called [#PrinciplesOfDevOps](/posts?tags=PrinciplesOfDevOps). If you're reading this in the future, be sure to check out this tag to see all installments.\r\n\r\n## What is DevOps?\r\n\r\nLet's kick off the series with a very basic question: What on earth is DevOps?\r\n\r\nDevOps is often used as an inflationary term to describe \"whatever comes after dev\". This can't be further from the truth.\r\n\r\nIn the past, developers, operations, designers, QA and other stakeholders of an applications were often implicitly trained to work in \"silos\". Once designers have finished their job, they pass their mockups to developers. When developers are done writing the application, they pass their code to operations, whose job it is to deploy it.\r\n\r\nDevOps is a set of practices that aims to combine the work of project stakeholders to unite people, process, and technology in application planning, development, delivery, and operations. Although the term DevOps only consists of \"Dev\" and \"Ops\", it has since evolved to include design, quality assurance and security. You may have heard of \"DevSecOps\", which aims to incorporate more roles into the term, but \"DevOps\" seems to stick the best with most people.\r\n\r\n## What does a \"DevOps Engineer\" do?\r\n\r\nI recently wrote a blog post about this: [The role of a DevOps Engineer](/posts/2023-04-22-the-role-of-a-devops-engineer).\r\n\r\nIn short, the job of a DevOps Engineer is to reduce the friction between stakeholders of a project. A collegue of mine explained this in a really good way:\r\n\r\n> A DevOps Engineer doesn't push the button, they enable the developers to push the button themselves.\r\n\r\n## Let's jump in!\r\n\r\nI hope by now you have a vague sense of what DevOps is. Next up, I want to uncover the principles and practices of DevOps. Thanks for reading to the end!\r\n\r\n---\r\n\r\nThis is post 072 of [#100DaysToOffload](https://100daystooffload.com/).\r\n\r\n\r\n","frontmatter":{"title":"Principles of DevOps: Introduction","date":"2023-07-11","tags":"note, practices, devops, PrinciplesOfDevOps, 100DaysToOffload, tech"},"tags":["note","practices","devops","PrinciplesOfDevOps","100DaysToOffload","tech"]},"recommendedPosts":[{"slug":"2026-02-13-n8n-nodes-open5e-n8n-community-node-that-lets-you-access-d-d-5th-edition-srd-content","frontmatter":{"title":"n8n-nodes-open5e: n8n community node that lets you access D&D 5th edition SRD content","date":"2026-02-13","tags":"note, tech, programming, n8n, automation, ttrpg"},"tags":["note","tech","programming","n8n","automation","ttrpg"]},{"slug":"2026-02-04-a-fix-for-long-pressing-movement-keys-in-vscode-with-vim-mode","frontmatter":{"title":"A fix for long-pressing movement keys in VSCode with Vim-Mode","date":"2026-02-04","tags":"guide, note, editors, tech, programming"},"tags":["guide","note","editors","tech","programming"]},{"slug":"2026-02-03-the-scientific-method","frontmatter":{"title":"The Scientific Method","date":"2026-02-03","tags":"note, practices, life, science"},"tags":["note","practices","life","science"]},{"slug":"2026-02-02-the-cult-of-done-manifesto","frontmatter":{"title":"The Cult of Done Manifesto","date":"2026-02-02","tags":"note, practices, writing, life, quote"},"tags":["note","practices","writing","life","quote"]},{"slug":"2025-12-11-custom-entities-in-home-assistant","frontmatter":{"title":"Custom Entities in Home Assistant","date":"2025-12-11","tags":"guide, note, homeassistant, homelab, tech, programming"},"tags":["guide","note","homeassistant","homelab","tech","programming"]}]},"__N_SSG":true}