{"pageProps":{"post":{"slug":"2024-08-03-how-embedding-models-encode-semantic-meaning","markdownBody":"\nEmbedding models have long been a daunting concept for me. But what are they? And why are they so useful? Let's break it down in simple terms.\n\n## What's an embedding?\n\nAn embedding is basically a numerical representation of a piece of information - it could be text, audio, an image, or even a video. Think of it as a way to capture the essence or meaning of that information in a list of numbers.\n\nFor example, let's say we have this text: \"show me a list of ground transportation at boston airport\". An embedding model might turn that into something like this:\n\n```\n[0.03793335, -0.008010864, -0.002319336, -0.0110321045, -0.019882202, -0.023864746, 0.011428833, -0.030349731, -0.044830322, 0.028289795, -0.02810669, -0.0032749176, -0.04208374, -0.0077705383, -0.0033798218, -0.06335449, ... ]\n```\n\nAt first, thus looks like a jumble of numbers. But each of these numbers points to a specific area within the embedding model's \"space\", where similar words or concepts might be located.\n\n## Visualizing embeddings\n\nTo help wrap our heads around this, let's look at a visualization. This beautiful image shows the entirety of the [nomic-embed-text-v1.5](https://huggingface.co/nomic-ai/nomic-embed-text-v1.5) embedding model, as generated by [this visualization tool](https://atlas.nomic.ai/map/nomic-text-embed-v1-5m-sample):\n\n![nomic-embed-text-v1.5-full](/assets/posts/2024-08-03-how-embedding-models-encode-semantic-meaning/nomic-embed-text-v1.5-full.jpeg)\n\nNow, if we take our example text about Boston airport transportation and plot its embeddings on this map, we'd see that some clusters are lit up, especially around \"transportation\". This means that the model has figured out that the topic of the query must be related to transportation in some way.\n\n![nomic-embed-text-v1.5-query](/assets/posts/2024-08-03-how-embedding-models-encode-semantic-meaning/nomic-embed-text-v1.5-query.jpeg)\n\nZooming into this image, we can see more specific topics around transportation, like \"Airport\", \"Travel\" or \"Highways\" are lit up, which more closely matches our query.\n\n![nomic-embed-text-v1.5-transportation](/assets/posts/2024-08-03-how-embedding-models-encode-semantic-meaning/nomic-embed-text-v1.5-transportation.jpeg)\n\nIn a nutshell, embedding models are able to group terms by topics that are related to each other.\n\n## Why should we care about embeddings?\n\nEncoding meaning in text has tons of different use cases. One that I'm particularly excited about is building RAG applications. RAG stands for Retrieval-Augmented Generation and refers to a method for Large Language Models (LLMs), where, given a question, you enrich the original question with relevant bits of information before answering it.\n\nHere's how embeddings are useful for RAG:\n\n1. You have a bunch of documents in your data source.\n2. You use an embedding model to turn each document into a list of numbers (like we saw earlier).\n3. When someone asks a question, you also turn that question into a list of numbers.\n4. Then, you find the documents whose number lists are most similar to your question's number list.\n5. Voila! You've found the most relevant documents to answer the question.\n\nThis method is way better than previously used techniques like just searching for exact words in the documents. It's like the difference between having a librarian who only looks at book titles, and one who actually understands what the books are about.\n\n## Other things you can do with embeddings\n\nBeyond RAG applications, embeddings are super useful for all sorts of things:\n\n1. **Smarter searches**: Find related stuff even if the exact words don't match.\n2. **Better recommendations**: \"You liked this? You might also like these similar things!\"\n3. **Language translation**: Help computers understand that \"dog\" in English and \"perro\" in Spanish mean the same thing.\n4. **Sentiment analysis**: Figure out if someone's happy or grumpy based on their tweet.\n\n## Wrapping it up\n\nEmbeddings are a clever way to turn words (or images, or sounds) into numbers that computers can understand and compare. By doing this, we can make emerging AI technologies a whole lot smarter at understanding language and finding connections between ideas.\n\nNext time you're chatting with an AI or getting scarily accurate recommendations online, you can nod knowingly and think, \"Ah yes, embeddings at work!\"\n\n","frontmatter":{"title":"How embedding models encode semantic meaning","date":"2024-08-03","tags":"note, tech, math, llm, ai"},"tags":["note","tech","math","llm","ai"]},"recommendedPosts":[{"slug":"2026-02-13-n8n-nodes-open5e-n8n-community-node-that-lets-you-access-d-d-5th-edition-srd-content","frontmatter":{"title":"n8n-nodes-open5e: n8n community node that lets you access D&D 5th edition SRD content","date":"2026-02-13","tags":"note, tech, programming, n8n, automation, ttrpg"},"tags":["note","tech","programming","n8n","automation","ttrpg"]},{"slug":"2026-02-04-a-fix-for-long-pressing-movement-keys-in-vscode-with-vim-mode","frontmatter":{"title":"A fix for long-pressing movement keys in VSCode with Vim-Mode","date":"2026-02-04","tags":"guide, note, editors, tech, programming"},"tags":["guide","note","editors","tech","programming"]},{"slug":"2025-12-11-custom-entities-in-home-assistant","frontmatter":{"title":"Custom Entities in Home Assistant","date":"2025-12-11","tags":"guide, note, homeassistant, homelab, tech, programming"},"tags":["guide","note","homeassistant","homelab","tech","programming"]},{"slug":"2025-09-15-making-family-it-support-effortless-and-free","frontmatter":{"title":"Making family IT support effortless (and free)","date":"2025-09-15","tags":"note, life, tech"},"tags":["note","life","tech"]},{"slug":"2025-06-11-git-diff-ignore-all-space-makes-code-reviews-way-easier","frontmatter":{"title":"git diff --ignore-all-space makes code review way easier","date":"2025-06-11","tags":"guide, note, til, git, tech, programming"},"tags":["guide","note","til","git","tech","programming"]}]},"__N_SSG":true}