{"pageProps":{"post":{"slug":"2025-09-15-making-family-it-support-effortless-and-free","markdownBody":"\nYesterday was one of those days where a family member had an issue with their computer. \"It doesn't open when I click it\" was all the information I had going into it. Debugging that through the telephone is just not happening.\n\nI always stayed away from TeamViewer, because I was never really sure if that had a free plan, and the possibility of finding out mid-session that they don't have one was reason enough to save the hassle of yelling the installation instructions through the phone.\n\nI remember hearing about [RustDesk](https://rustdesk.com/) in a podcast a couple of years ago. The host claimed it to be a hassle-free open source replacement for TeamViewer, but by the time the next IT-support session arrived, I already forgot about it. Until yesterday!\n\nYesterday, I just didn't get enough information to be useful. I just needed a way to remotely access the computer, and that's then I remembered the promise of RustDesk. Going in blind, I quickly installed the client on my laptop and sent a mail with the instructions to my family member:\n\n1. Click here (a download link to the executable file)\n2. Press the windows key\n3. Type \"rust\" (to search for the file)\n4. Press enter\n5. Tell me the ID and the onetime password on the screen\n\nThese instructions are fool-proof! And sure enough, they worked. I logged in and debugged the issue. No paywall, no corporate bullsh**, just a simple client that just works as intended out of the box. I was delighted to see that the plan has worked out. Going forward, Rustdesk will be my primary choice for remote IT support.\n\nIf you're interested: for some reason the browser window on their screen was resized to a tiny box near the edge of the screen, so whenever they clicked a bookmarked link on their desktop, instead of \"nothing happening\", they just didn't see the page opening in the browser.\n\n## TL;DR\n\nUse [RustDesk](https://rustdesk.com/) instead of TeamViewer for a free and easy way to access your family's computer remotely.\n","frontmatter":{"title":"Making family IT support effortless (and free)","date":"2025-09-15","tags":"note, life, tech"},"tags":["note","life","tech"]},"recommendedPosts":[{"slug":"2026-02-13-n8n-nodes-open5e-n8n-community-node-that-lets-you-access-d-d-5th-edition-srd-content","frontmatter":{"title":"n8n-nodes-open5e: n8n community node that lets you access D&D 5th edition SRD content","date":"2026-02-13","tags":"note, tech, programming, n8n, automation, ttrpg"},"tags":["note","tech","programming","n8n","automation","ttrpg"]},{"slug":"2026-02-11-on-seeking-order-in-chaos","frontmatter":{"title":"On Seeking Order in Chaos","date":"2026-02-11","tags":"note, learnings, life"},"tags":["note","learnings","life"]},{"slug":"2026-02-04-a-fix-for-long-pressing-movement-keys-in-vscode-with-vim-mode","frontmatter":{"title":"A fix for long-pressing movement keys in VSCode with Vim-Mode","date":"2026-02-04","tags":"guide, note, editors, tech, programming"},"tags":["guide","note","editors","tech","programming"]},{"slug":"2026-02-03-the-scientific-method","frontmatter":{"title":"The Scientific Method","date":"2026-02-03","tags":"note, practices, life, science"},"tags":["note","practices","life","science"]},{"slug":"2026-02-02-the-cult-of-done-manifesto","frontmatter":{"title":"The Cult of Done Manifesto","date":"2026-02-02","tags":"note, practices, writing, life, quote"},"tags":["note","practices","writing","life","quote"]}]},"__N_SSG":true}