{"pageProps":{"post":{"slug":"2024-04-02-fuck-trees-use-tags","markdownBody":"\r\nWe've been trained to organize our files into a tree-like structure. A file can only exist once in the entire tree. It may have multiple contexts, but it can only exist once. Here's an example: you get a really important invoice for your car that you have to keep for your taxes. Where do you store this invoice alongside your other files?\r\n\r\n* Maybe organized by type:`/invoices/important_invoice.pdf`?\r\n* Or `/tax/2024/important_invoice.pdf` since that's where you will probably need it next?\r\n* But it's an invoice for my car! So `/vehicles/<licenseplate>/important_invoice.pdf`?\r\n\r\nWhatever strategy you choose, there are probably times where you wish to have used a different directory structure. Sure, you can put the file in one directory and then create a shortcut or link in the other directories, but the original file will only ever exist in one place.\r\n\r\nI believe that these tree-like directory structures are inherently flawed, and that tagging systems are superior in almost every way.\r\n\r\nWhat I mean by tags is to organize files/entities/whatever into a flat structure and add meaningful tags/labels to add context. To revise the example above: our `important_invoice.pdf` could have the following tags:\r\n\r\n* `invoice`\r\n* `vehicles/<licenseplate>`\r\n* `tax/2024`\r\n\r\nOne could argue that `vehicles` and `tax` could be their own tags, but I specifically choose these tags to prove an important point:\r\n\r\n## Tags can mimic trees\r\n\r\nIf you think about it, a file path in a sense is just a reference to some location. Files on a physical hard drive aren't organized in trees. They're a bunch of ones and zeros slapped together in a pool of other files. A file path is just an abstraction for the user to reference a specific location in this pool of files. A file path is a tag!\r\n\r\nUnfortunately, most systems are designed to only allow one path per file. This creates the hierarchical structure we so often use. But as I mentioned above, we could simply assign multiple tags or paths to a single file to organize it in multiple ways. The `important_invoice.pdf` has little to do with `tax` or `2024` as standalone terms, but assigning the tag `tax/2024`  gives it a similar meaning as a path to a file in a directory. The term `invoice` is enough to infer that everything using this tag is an invoice. It's equivalent to having a directory named `invoices` with multiple files inside.\r\n\r\nSo, we have established that tags are easily superior to trees. Why are we not using them?\r\n\r\n## Tags have bad UX\r\n\r\nThere have been many attempts at giving users the possibility to organize their stuff using tags. Your Gmail mails can be labeled, you can use tags for files in MacOS and there are apparently even efforts to create [tag-based filesystems](https://relfs.sourceforge.net/). But none of them were good enough to change the game.\r\n\r\nOur brains seem to be so used to the idea of a piece of information only existing at one location at a time that it's really hard to adapt at this point. I'm sure there are some power users out there who make the most of the limited tagging features of their systems, but what I would really like to see is a real shift in how we store and retrieve information.\r\n\r\n## Discussion\r\n\r\nThis post has spark some interesting discussion on [Lobsters](https://lobste.rs/s/pssbmx/fuck_trees_use_tags).\r\n","frontmatter":{"title":"Fuck trees, use tags","date":"2024-04-02","tags":"note, opinion, tech"},"tags":["note","opinion","tech"]},"recommendedPosts":[{"slug":"2026-02-04-a-fix-for-long-pressing-movement-keys-in-vscode-with-vim-mode","frontmatter":{"title":"A fix for long-pressing movement keys in VSCode with Vim-Mode","date":"2026-02-04","tags":"guide, note, editors, tech, programming"},"tags":["guide","note","editors","tech","programming"]},{"slug":"2025-12-11-custom-entities-in-home-assistant","frontmatter":{"title":"Custom Entities in Home Assistant","date":"2025-12-11","tags":"guide, note, homeassistant, homelab, tech, programming"},"tags":["guide","note","homeassistant","homelab","tech","programming"]},{"slug":"2025-09-15-making-family-it-support-effortless-and-free","frontmatter":{"title":"Making family IT support effortless (and free)","date":"2025-09-15","tags":"note, life, tech"},"tags":["note","life","tech"]},{"slug":"2025-06-11-git-diff-ignore-all-space-makes-code-reviews-way-easier","frontmatter":{"title":"git diff --ignore-all-space makes code review way easier","date":"2025-06-11","tags":"guide, note, til, git, tech, programming"},"tags":["guide","note","til","git","tech","programming"]},{"slug":"2025-05-20-no-matter-what-you-do-always-leave-a-breadcrumb","frontmatter":{"title":"No matter what you do, always leave a breadcrumb","date":"2025-05-20","tags":"note, practices, writing, life, tech"},"tags":["note","practices","writing","life","tech"]}]},"__N_SSG":true}