{"pageProps":{"post":{"slug":"2022-04-25-weeknote-16-2022","markdownBody":"\nThis is my first (already belated) weeknote. Even though it's the monday of the\nnext week, I thought I'd reflect on what happened last week. I already tried [a\nsimilar format](/posts/2020-12-18-update-december) on this blog in a monthly\nfashion, but didn't stick to it. With these \"weeknotes\", I will try to sit down\nfor half an hour each friday. This is heavily inspired by [Doug Belshaw's posts\nwith the same name](https://dougbelshaw.com/blog/).\n\n## At work\n\nThere's currently an effort to integrate a whole new backend into our\napplication. Fundamental features like user- and role-management will have to be\nmigrated to this new backend, which is mostly incompatible with our current\none. As I'm currently the only developer on the project, building a concept\nand realizing it will mostly be my part. I'm somewhat frightened about this\nundertaking, but I think I will learn a whole lot.\n\nI also introduced versioned deployments for our application. To keep it simple,\nreleases are versioned by date (E.g. `v2022.04.21`). Alongside this, I also\nadded a changelog describing each release. I'm still unsure whether this gives\nus a benefit or if it's just unnecessary work, but time will tell. I'm curious\nof what you - the reader - thinks of this. Feel free to reply to this post via\nthe link at the bottom of the page.\n\n## On this blog\n\nI'm playing around with ideas about comments on this static website. I yanked\nout some thoughts in this thread, but I'll have to think about it a bit more:\n\n<iframe src=\"https://fosstodon.org/@garritfra/108180821665987615/embed\"\nclass=\"mastodon-embed\" style=\"max-width: 100%; border: 0; height: 21rem\" width=\"400\"\nallowfullscreen=\"allowfullscreen\"></iframe><script\nsrc=\"https://fosstodon.org/embed.js\" async=\"async\"></script>\n\n## Plants\n\nMy girlfriend and I are in love with plants. This week, we went to a nursery and\ngot ourselves a new member to our family: a Monstera Adansonii.\n\n![Monstera Adansonii](/assets/monstera_adansonii.jpeg)\n\nI also did a little experiment with one of my eucalyptus citriodoras. I cut it\nfrom 50cm back to the first \"node\" in the trunk, at about 2cm. I'm quite happy\nwith how it evolved in just about 10 months. It's now time to develop some\nbranches. Here's it before the pruning:\n\n![Eucalyptus before pruning](/assets/eucalyptus_before_pruning.jpeg)\n\nAnd this is what it looks like now:\n\n![Eucalyptus after pruning](/assets/eucalyptus_after_pruning.jpeg)\n\nI also made cuttings from the rest of the stem. Not sure if they'll survive, but\nwhat could I lose?\n\nThat's it for this week. Thanks for reading!\n\nThis is post 027 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"Weeknote 16/2022","date":"2022-04-25","tags":"weeknote, 100DaysToOffload"},"tags":["weeknote","100DaysToOffload"]},"recommendedPosts":[{"slug":"2022-05-06-weeknote-18-2022","markdownBody":"\nIt's friday, my dudes! Here are some notes on what happened during my week.\n\n## At Work\n\nI wanted to start off my week by looking into migrating our deployment workflow\nto a GitLab Agent, as described [last week](/posts/2022-04-29-weeknote-17-2022).\nThat didn't really go well, since a database from another project bursted into\nflames (not literally) for a reason I still couldn't figure out. As a\nworkaround, I just beefed up the AWS RDS instance size until we find a proper\nsolution.\n\nWhile looking through the docs, I also read more about [Aurora\nServerless](https://aws.amazon.com/de/rds/aurora/serverless/), which would be a\nmatch made in heaven, at least for this specific project. Instead of keeping\nmultiple instances running even without any load, serverless automatically\nscales to as many resources as you need. This **drastically** improves\nperformance (according to the docs it's instantaneous, but I'll have to see that\nwith my own eyes), while keeping the price at a minimum. Once we're done with\nthat migration, I'll probably follow up with a blog post on this.\n\n## Home Automation\n\nWe recently wanted to configure a light in our bedroom to turn on early and the\nmorning, stay on for a few hours and then turn off. Same for the evening.\n\nSoo, I ordered two power plugs pre-flashed with\n[Tasmota](https://tasmota.github.io/docs/) and yanked HomeAssistant onto an old\nPi. The plugs came as a pair, so I automated another light in our home. I think\nthis will be the beginning of a deep deep rabbit hole.\n\nWe'll be moving to a new flat soon, where humidity is higher than usual. I'm\nthinking to monitor this and react with some counter-measures, like air filters.\nSky is the limit, really. More to follow...\n\n## Motorbike Maintenance\n\nI was long due to dust off my motorbike, but I finally did. Also, I did my first\noil change on a vehicle **ever**!\n\n![Motorbike oil change](/assets/posts/2022-05-06-weeknote-18-2022/motorbike_oil_change.jpeg)\n\nFeels great to finally be back on the road.\n\n## Fun Fun Fun\n\nBesides riding my motorbike, we went to a fair in our town. It was the first\ntime in years that I've been to a fair, and to ride bumper cars.\n\nAlso, I met up with a friend I haven't seen in a while. It was great taking a\nwalk and talking about life.\n\nThat's it for this week. Thanks for reading!\n\nThis is post 030 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"Weeknote 18/2022","date":"2022-05-06","tags":"weeknote, 100DaysToOffload"},"tags":["weeknote","100DaysToOffload"]},{"slug":"2022-04-29-weeknote-17-2022","markdownBody":"\nThis week was quite ordinary. We enjoyed the weather during walks in the park\nand got some chores done.\n\n## At work\n\nA major news this week was that GitLab decided to remove [certificate-based\ncluster\naccess](https://docs.gitlab.com/ee/user/project/clusters/deploy_to_cluster.html#deploy-to-a-kubernetes-cluster-with-cluster-certificates-deprecated)\nto Kubernetes clusters sooner as we hoped. We're now fleshing out how to migrate\nto the newer\n[gitlab-agent](https://docs.gitlab.com/ee/user/clusters/agent/install/index.html).\n\nI also got some refactoring work done. In one of our projects, we're currently\nmigrating our GraphQL queries away from a HOC-pattern towards React hooks, using\nthe amazing\n[apollo-augmented-hooks](https://github.com/appmotion/apollo-augmented-hooks)\nlibrary for additional caching features.\n\n## Sideprojects\n\nI continued to work on a secret side-project of mine, but I don't want to spoil\nanything just yet.\n\nBUT! If you're good at writing and would like to help out writing a couple of\nparagraphs that can catch the users attention, [I'd love to hear from\nyou](/contact).\n\nThat's it for this week. Thanks for reading!\n\nThis is post 029 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"Weeknote 17/2022","date":"2022-04-29","tags":"weeknote, 100DaysToOffload"},"tags":["weeknote","100DaysToOffload"]}]},"__N_SSG":true}