{"pageProps":{"post":{"slug":"patch-based-git-workflow","markdownBody":"\nIf you have ever contributed to an open source project, chances are you have opened a pull request on GitHub or a similar platform to present your code to the maintainers. While this is a very approachable way of getting your code reviewed, some projects have decided against using pull requests and instead accept patches via email.\n\n## An introduction to patches\n\nA patch is essentially a git commit expressed in plain text. It describes what commit the change is based on, and what has changed. A basic patch looks like this:\n\n```\nFrom 92132241233033a123c4fa833449d6a0d550219c Mon Sep 17 00:00:00 2001\nFrom: Bob <bob@example.com>\nDate: Tue, 25 May 2009 15:42:16 +0200\nSubject: [PATCH 1/2] first change\n\n---\n test.txt |    1 +-\n 1 files changed, 1 insertions(+), 1 deletions(-)\n\ndiff --git a/test.txt b/test.txt\nindex 7634da4..270eb95 100644\n--- a/test.txt\n+++ b/test.txt\n@@ -1 +1 @@\n-Hallo Bob\n+Hallo Alice!\n```\n\nAs you can see, it is very readable for both the reviewer and the machine.\n\n## Sending and receiving patches\n\nThe easiest way you can generate a patch from a commit is to use `git-format-patch`:\n\n```\ngit format-patch HEAD^\n```\n\nThis will generate a `.patch` file, that can be embedded into an email and sent to the maintainers. Oftentimes they will then reply to your mail with some inline comments about your code.\n\nTo simplify this process further, git has the `send-email` command, which let's you send the patch directly to someone without needing to embed it manually. I won't go into details about this, but there is a [well written guide](https://git-send-email.io/) on how to set it up.\n\nIf you have received a patch from someone, you can apply it to your tree with the `am` (apply mail) command:\n\n```\ngit am < 0001-first-change.patch\n```\n\ncheck your `git log` to see the patch in form of the latest commit.\n\n## Why even bother\n\nYou might think that this is just a silly and outdated approach to collaborative development. \"Why not simply open a pull request?\" you might ask. Some projects, especially low-level oriented ones like the Linux kernel, do not want to rely on third-party platforms like GitHub to host their code, with good reasons:\n\n1. Everyone can participate! You don't need to register an account on some proprietary website to collaborate in a project that uses a patch-based workflow. You don't even have to expose your identity, if you don't want to. All you need is an email-address, and frankly most of us have one.\n2. It's plain simple! Once you get used to generating and applying patches on the command line, it is in fact easier and faster than opening a pull request in some clunky GUI. It doesn't get simpler than plain text.\n3. It is rewarding! Once you have submitted a patch to a project, there is no better feeling than getting a simple \"Applied, thanks!\" response from a maintainer. And if it's a response that contains feedback rather than an approval, it feels even better to submit that reworked code again and get it eventually applied.\n\n## Conclusion\n\nThe patch-based workflow is an alternative way to collaborate with developers. If it helps you in your day to day business depends on the projects you are contributing to, but in the end it is always good to have many tools under your belt.\n","frontmatter":{"title":"The Patch-Based Git Workflow","date":"2020-09-28","tags":"git, guide, programming"},"tags":["git","guide","programming"]},"recommendedPosts":[{"slug":"2023-09-11-linkdump-software-development","frontmatter":{"title":"🔗 Linkdump: Software Development","date":"2023-09-11","tags":"note, 100DaysToOffload, linkdump, programming, tech"},"tags":["note","100DaysToOffload","linkdump","programming","tech"]},{"slug":"2023-06-01-single-page-applications-on-github-pages","frontmatter":{"title":"Single Page Applications on GitHub Pages","date":"2023-06-01","tags":"100DaysToOffload, guide, note, web, javascript, github"},"tags":["100DaysToOffload","guide","note","web","javascript","github"]},{"slug":"2023-04-27-migrating-homeassistant-from-sd-to-ssd","frontmatter":{"title":"Migrating Homeassistant from SD to SSD","date":"2023-04-27","tags":"100DaysToOffload, guide, note, homeassistant, homelab"},"tags":["100DaysToOffload","guide","note","homeassistant","homelab"]},{"slug":"2023-04-12-instant-dark-theme","frontmatter":{"title":"Instant dark theme","date":"2023-04-12","tags":"100DaysToOffload, guide, note, learnings, web, css, til"},"tags":["100DaysToOffload","guide","note","learnings","web","css","til"]},{"slug":"2023-03-30-designing-resilient-cloud-infrastructure","frontmatter":{"title":"Designing resilient cloud infrastructure","date":"2023-03-30","tags":"100DaysToOffload, infrastructure, aws, guide, note, learnings"},"tags":["100DaysToOffload","infrastructure","aws","guide","note","learnings"]}]},"__N_SSG":true}