{"pageProps":{"post":{"slug":"2023-12-15-i-m-finally-off-coffee","markdownBody":"\nDisclaimer: There's no real story here — just a dump of my thoughts.\n\nI used to drink two cups of coffee a day on average. One during breakfast and one during the day.\n\nOn days where it was difficult to get my hands on coffee — during camping for example, or on some days where I don't really have time to brew a coffee — I would routinely get headaches. This might have been a coincidence, but it's not unlikely that my body was craving this delicious drink. Waking up was always accompanied by this nagging feeling of how I'm gonna get my dose of coffee today.\n\nThat all changed when I got sick a few weeks ago. I wasn't feeling well for a few days, and as a result I didn't drink coffee at all. Knowing that caffeine is a huge stress-inducing factor in my day to day life, I decided to just not start drinking it again once I felt better.\n\nQuitting caffeine cold turkey can be difficult, but two cups isn't much. Some of my peers drink way more than that. While being sick, my body quickly adjusted to the missing two cups each day. I wasn't feeling good anyway, so what's an extra mild headache?\n\nNow, about two weeks later, I feel great. There's one stress-factor less in my life. I occasionally still drink coffee with friends, but it's not something I crave directly after waking up. I opted for caffeine-free tea in the morning. We also have decaffeinated coffee at home, but it feels to me like brewing decaffeinated coffee isn't worth the effort. It's still a nice alternative for nice breakfasts on the weekend.\n\n---\n\nThis is post 094 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"I'm finally off coffee","date":"2023-12-15","tags":"100DaysToOffload, note, life"},"tags":["100DaysToOffload","note","life"]},"recommendedPosts":[{"slug":"2023-12-19-another-reason-you-can-t-divide-by-zero","frontmatter":{"title":"Another reason you can't divide by zero","date":"2023-12-19","tags":"100DaysToOffload, note, life, til, math"},"tags":["100DaysToOffload","note","life","til","math"]},{"slug":"2023-12-18-overcoming-air-hunger","frontmatter":{"title":"Overcoming \"air hunger\"","date":"2023-12-18","tags":"100DaysToOffload, guide, note, life, til"},"tags":["100DaysToOffload","guide","note","life","til"]},{"slug":"2023-12-01-field-notes-3","frontmatter":{"title":"Field Notes #3","date":"2023-12-01","tags":"100DaysToOffload, note, life, notebooks"},"tags":["100DaysToOffload","note","life","notebooks"]},{"slug":"2023-11-07-app-defaults","frontmatter":{"title":"My App Defaults (Late 2023)","date":"2023-11-07","tags":"100DaysToOffload, note, fun, life, random"},"tags":["100DaysToOffload","note","fun","life","random"]},{"slug":"2023-10-10-did-you-try-turning-it-off","frontmatter":{"title":"Did you try turning it off?","date":"2023-10-10","tags":"100DaysToOffload, note, opinion, life"},"tags":["100DaysToOffload","note","opinion","life"]}]},"__N_SSG":true}