{"pageProps":{"post":{"slug":"2025-05-20-no-matter-what-you-do-always-leave-a-breadcrumb","markdownBody":"\nThis applies to work tasks just as much as it applies to hobbies. No matter what you do, always create some sort of breadcrumb that you or someone else can pick up down the line.\n\nIf you build a feature into your app, you've generated an output, and therefore value. But what if you bang your head against the wall and don't make any progress? Write about it. Write about your challenges, document what you've learned and share it with your peers. Not reaching a set goal doesn't mean failure. It's an opportunity to create value in a way you didn't anticipate.\n\nIf you're out on a run and a thought pops into your head, record a memo on your phone, or better yet: [keep a tiny notebook with you at all times](https://garrit.xyz/posts/2023-09-09-everyday-carry-notebooks). Thoughts slip in and out of our heads at a very rapid pace. Capturing thoughts, even if you don't share them with anyone else, is a great way to generate value out of thin air.\n\nIf you're into crafty hobbies like woodworking, painting or baking, you likely know how important it is to finish a project. No matter how good or bad the outcome is, every finished project is an artifact that you can look back at later and see the progress you've made.\n\nOutput always means value, even if it's not immediately apparent. Just keep on laying down those breadcrumbs.\n\n\n","frontmatter":{"title":"No matter what you do, always leave a breadcrumb","date":"2025-05-20","tags":"note, practices, writing, life, tech"},"tags":["note","practices","writing","life","tech"]},"recommendedPosts":[{"slug":"2025-03-25-container-interfaces","frontmatter":{"title":"About Container Interfaces","date":"2025-03-25","tags":"infrastructure, note, tech"},"tags":["infrastructure","note","tech"]},{"slug":"2025-02-27-a-trick-to-manage-frequently-used-prompts-in-claude-chatgpt","frontmatter":{"title":"A trick to manage frequently used prompts in Claude/ChatGPT","date":"2025-02-27","tags":"guide, note, tech, llm, ai"},"tags":["guide","note","tech","llm","ai"]},{"slug":"2024-12-29-2024-in-review","frontmatter":{"title":"2024 in Review","date":"2024-12-29","tags":"note, life, review"},"tags":["note","life","review"]},{"slug":"2024-09-24-installing-mssql-client-drivers-for-a-php-application","frontmatter":{"title":"Installing MSSQL Client Drivers for a PHP Application","date":"2024-09-24","tags":"guide, note, web, tech, programming, php"},"tags":["guide","note","web","tech","programming","php"]},{"slug":"2024-09-01-AI-fog","frontmatter":{"title":"Mental AI Fog and how to cure it","date":"2024-09-01","tags":"note, ai, life, writing"},"tags":["note","ai","life","writing"]}]},"__N_SSG":true}