{"pageProps":{"post":{"slug":"2023-12-18-overcoming-air-hunger","markdownBody":"\nFor as long as I can remember, I often had the feeling of not being able to get a full breath. I'm taking deep breaths and sometimes forcing a yawn to overcome this feeling, sometimes successful, sometimes failing and trying again. This feeling gets worse the more I focus on my breath.\n\nI always felt like this is somewhat uncommon, since none of my friends and family can relate to this feeling, but it wasn't worse enough to justify consulting a doctor about it either.\n\nDoing some research, it seems like this phenomenon is called [dyspnea](https://en.m.wikipedia.org/wiki/Shortness_of_breath), or \"air hunger\". Some guy even made [a website](https://airhunger.org/) about it. In a nutshell, it is caused by your body not being able to regulate carbon levels in your blood, which leads to an urge to breath unnaturally.\n\nIn a [video](https://m.youtube.com/watch?v=XliOGg8Tl98), the author points out that this might be caused by irregular breathing patterns. Indeed, I often find myself breathing through the mouth or sitting in awkward positions with a humpback when the symptoms are at its worst. In fact, what led me to look this up was because I was annoyed by the feeling while I'm laying in bed staring down at my screen, which is a very unnatural position.\n\nA simple trick to get into a more regular breathing pattern is apparently to force yourself to breathe through the nose. Mouth breathing lets your body take in way more air than you need, which throws off the balance of the carbon levels in your lungs.\n\nIt seems like nose breathing does work very well. Where I've just been struggling with air hunger, once I forced myself to nose breathe, the urge to breathe doesn't come nearly as often anymore.\n\nThese are just my results after some quick research. The topic of short breathing seems to be quite broad. Perhaps you're struggling with this as well. In that case, I hope this post was helpful to you!\n\n---\n\nThis is post 095 of [#100DaysToOffload](https://100daystooffload.com/).\n\n","frontmatter":{"title":"Overcoming \"air hunger\"","date":"2023-12-18","tags":"100DaysToOffload, guide, note, life, til"},"tags":["100DaysToOffload","guide","note","life","til"]},"recommendedPosts":[{"slug":"2023-12-30-2023-in-review","frontmatter":{"title":"2023 in review","date":"2023-12-30","tags":"note, opinion, life, review"},"tags":["note","opinion","life","review"]},{"slug":"2023-12-19-another-reason-you-can-t-divide-by-zero","frontmatter":{"title":"Another reason why you can't divide by zero","date":"2023-12-19","tags":"100DaysToOffload, note, til, math"},"tags":["100DaysToOffload","note","til","math"]},{"slug":"2023-12-15-i-m-finally-off-coffee","frontmatter":{"title":"I'm finally off coffee","date":"2023-12-15","tags":"100DaysToOffload, note, life"},"tags":["100DaysToOffload","note","life"]},{"slug":"2023-12-11-formula-e-is-essentially-mario-kart","frontmatter":{"title":"Formula E is essentially Mario Kart","date":"2023-12-11","tags":"100DaysToOffload, note, til, random"},"tags":["100DaysToOffload","note","til","random"]},{"slug":"2023-12-01-field-notes-3","frontmatter":{"title":"Field Notes #3","date":"2023-12-01","tags":"100DaysToOffload, note, life, notebooks"},"tags":["100DaysToOffload","note","life","notebooks"]}]},"__N_SSG":true}