{"pageProps":{"post":{"slug":"2022-12-05-contributing-to-open-source-knowledge","markdownBody":"\nI wrote the initial draft for this post a few months ago, traveling through\nNorway in a rented campervan. While roaming the beautiful landscapes, I spent a\nlot of time thinking. Reading books while traveling really is the best way to\nfind new inspiration.\n\nOn our trip, we wanted to try out an alternative to Google Maps. Most of the\nOpenStreetMap-based apps lack important features, but we recently stumbled upon\n[MagicEarth](https://www.magicearth.com/), which perfectly fills the void.\nOpenStreetMap has been 95% accurate for us. Those last 5% are mostly less famous\nhiking trails and attractions that could easily be filled in by people like you\nand me. This inspired me to write this blog post, where I share six ways that\nyou can contribute to open source knowledge right now.\n\n## OpenStreetMap\n\nAs mentioned above, I spotted some minor inconsistencies in\n[OpenStreetMap](https://openstreetmap.org) while driving through Norway. We\ntracked our hikes with an app that is able to export a GPX file, which can be\nimported to OpenStreetMap to check if the trail matches (or if it is missing),\nand took note of incorrect or sloppy roads/buildings. Back home, I plan to sit\ndown and fix up those issues.\n\nBut you don't have to be on a roadtrip to contribute to OpenStreetMap! Chances\nare you know your local surroundings pretty well. Just navigate to your\nneighborhood and see what could be improved. Maybe you know a public toilet, a\npark or a secret road that is not shown on the map? As a matter of fact, my\nprivate address was missing, so I added it via the editor. I can now use any of\nthe many OpenStreetMap-based apps to navigate home!\n\n## Wikipedia (and other wikis)\n\nI often feel like I can't contribute much to the vast knowledge of Wikipedia.\n_Other people are way smarter than me_ and whatnot. But while you might not be\nable to publish worthy edits to a well-known topic, you might know some things\nthat others haven't thought of. Is there an entry about your local town? Is\nthere an interesting member of your (past) family that others might want to read\nabout?\n\nOf course, there are other wikis beside Wikipedia. Are you using a little-known\ntool that has open source documentation in the form of a wiki? How can it be\nimproved?\n\n## Observation\n\nYou might have never heard of [observation.org](https://observation.org). It's\nan open biodiversity- and nature-database. I just recently learned about them in\nour local museum. They had a special exhibition about insects, and called out\nfor contributions to map out our local flora and fauna.\n\nThe idea is simple: snap a picture of an interesting looking insect or plant,\nupload it using the website (or one of their apps) and create an \"observation\".\nUsing this information, researchers will be able to understand the biodiversity\nof your area. The information is free to use, and anyone can contribute!\n\n## Wardriving\n\nWardriving is a fun and useful way to contribute to open source knowledge. By\ndriving around with a device that can detect and record wireless networks, you\ncan help to map out the wireless coverage in your area. This information can be\nused by researchers, network operators, and other interested parties to\nunderstand the availability and quality of wireless networks.\n\nOne popular tool for wardriving is [WiGLE](https://wigle.net/). WiGLE allows you\nto easily collect and share information about wireless networks, and contribute\nto the global wireless map. To get started with WiGLE, you will need a device\nthat can detect and record wireless networks. This can be a smartphone, laptop,\nor dedicated wardriving device. You will also need to download and install the\nWiGLE app, and some basic knowledge of how to use it.\n\nOnce you have set up WiGLE, you can start driving around and mapping out the\nwireless networks in your area. As you collect data, it will be automatically\nuploaded to the WiGLE database, where it can be used by researchers and other\ninterested parties. Wardriving with WiGLE is a fun and easy way to help advance\nscientific research and understanding.\n\n## folding@home\n\nAnother way to contribute to open source knowledge is to participate in the\n[folding@home](https://foldingathome.org/) project. folding@home is a\ndistributed computing project that uses the idle processing power of volunteers'\ncomputers to perform scientific calculations and simulations. These calculations\nare used to study a wide range of topics, including protein folding, drug\ndesign, and the origins of the universe.\n\nBy joining the folding@home network, you can help to advance scientific research\nand discovery. The project is open to anyone, and you can participate using your\npersonal computer, laptop, or even your smartphone. All you need to do is\ndownload and install the folding@home software, and then select the types of\ncalculations that you want to contribute to.\n\nThe folding@home project is a great way to put your idle computing power to good\nuse, and to contribute to the global effort to advance scientific knowledge. To\nlearn more, visit the [folding@home website](https://foldingathome.org/).\n\n## Blog posts\n\nWriting a blog post is a fun and engaging way to contribute to open source\nknowledge. You don't need to be a professional writer or have a formal writing\nstyle. Just jot down some notes about a topic that you are passionate about, and\nshare your experiences and expertise with others.\n\nNot only will you be helping others to learn from your experiences, but writing\na blog post can also be beneficial for yourself. Capturing your thoughts and\nideas in writing can help you to better understand and organize your own\nknowledge. It can also be a great way to reflect on your experiences and to\nlearn from your successes and failures.\n\nIf you're interested in blogging, you might want to check out the\n[100DaysToOffload](https://100daystooffload.com/) project!\n\n# Wrapping up\n\nAs you can see, there are many ways that you can contribute to open source\nknowledge, even if you don't have a lot of time or expertise. By participating\nin projects like OpenStreetMap, Wikipedia, observation.org, and folding@home, or\nby sharing your experiences and expertise through blog posts, you can make a\nreal difference in the community.\n\nWhy not give it a try? You might be surprised by how much you can learn and how\nmuch you can help others. And who knows, you might even have some fun along the\nway! Thanks for reading, and happy contributing!\n\nThis is post 044 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"6 ways you can contribute to open knowledge right now","date":"2022-12-05","tags":"note, guide, practices, 100DaysToOffload"},"tags":["note","guide","practices","100DaysToOffload"]},"recommendedPosts":[{"slug":"2023-06-01-single-page-applications-on-github-pages","frontmatter":{"title":"Single Page Applications on GitHub Pages","date":"2023-06-01","tags":"100DaysToOffload, guide, note, web, javascript, github"},"tags":["100DaysToOffload","guide","note","web","javascript","github"]},{"slug":"2023-05-19-work-batch-sizing","frontmatter":{"title":"Optimizing work batch size","date":"2023-05-19","tags":"100DaysToOffload, note, practices, learnings, life, devops"},"tags":["100DaysToOffload","note","practices","learnings","life","devops"]},{"slug":"2023-04-27-migrating-homeassistant-from-sd-to-ssd","frontmatter":{"title":"Migrating Homeassistant from SD to SSD","date":"2023-04-27","tags":"100DaysToOffload, guide, note, homeassistant, homelab"},"tags":["100DaysToOffload","guide","note","homeassistant","homelab"]},{"slug":"2023-04-22-the-role-of-a-devops-engineer","frontmatter":{"title":"The role of a DevOps Engineer","date":"2023-04-22","tags":"100DaysToOffload, note, practices, devops"},"tags":["100DaysToOffload","note","practices","devops"]},{"slug":"2023-04-12-instant-dark-theme","frontmatter":{"title":"Instant dark theme","date":"2023-04-12","tags":"100DaysToOffload, guide, note, learnings, web, css, til"},"tags":["100DaysToOffload","guide","note","learnings","web","css","til"]}]},"__N_SSG":true}