{"pageProps":{"post":{"slug":"2023-04-28-serverless-framework-retrospective","markdownBody":"\r\nA current project requires the infrastructure to be highly scalable. It's expected that > 50k Users hit the platform within a five minute period. Regular ECS containers take about one minute to scale up. That just won't cut it. I decided to go all in on the [serverless](https://www.serverless.com/) framework on AWS. Here's how it went.\r\n\r\n### Setup\r\n\r\nSetting up a serverless application was a breeze. You create a config file and use their CLI to deploy the app.\r\n\r\n### The rest of the infrastructure\r\n\r\nI decided to define the rest of the infrastructure (VPC, DB, cache, ...) in Terraform. But, since I wasn't familiar with how the Serverless Framework worked, I struggled to draw the line between what serverless should handle vs. what the rest of the infrastructure (Terraform) should provide. In a more traditional deployment workflow, you might let the CI deploy a container image to ECR and point the ECS service to that new image.\r\n\r\nI chose to let Serverless deploy the entire app through CI and build the rest of the infrastructure around it. The problem with this approach is that we lose fine-grained control over what's deployed where, which leads to a lot of permission errors.\r\n\r\nIn retrospect, I should've probably chosen the location of the S3 archive as the deployment target for the CI, and then point the lambda function to the location of the new artifact. This defeats the purpose of the framework, but it gives you a lot more control over your infrastructure. Once the next project comes along, I'll probably go that route instead.\r\n\r\n### Permissions\r\n\r\nServerless suggests to use admin permissions for deployments, and I see where they're coming from. Managing permissions in this framework is an absolute mess. Here's what the average deployment workflow looks like, if you want to use fine grained permissions:\r\n\r\n1. Wait for CloudFormation to roll back changes (~2 minutes)\r\n2. Update IAM role\r\n3. Deploy Serverless App\r\n4. If there's an error, go to 1\r\n\r\nThankfully, some people have already gone through the process of figuring this out. [Here's](https://serverlessfirst.com/create-iam-deployer-roles-serverless-app/#determining-deploy-time-permissions) a great guide with a starting point of the needed permissions.\r\n\r\n### Conclusion\r\n\r\nUsing the serverless framework is a solid choice if you just want to throw an app out there. Unfortunately the app I was deploying isn't \"just\" a dynamic website. The next time I'm building a serverless application it's probably not going to be with the Serverless Framework, though I learned a lot about serverless applications in general.\r\n\r\n---\r\n\r\nThis is post 067 of [#100DaysToOffload](https://100daystooffload.com/).\r\n\r\n\r\n\r\n\r\n","frontmatter":{"title":"Serverless Framework Retrospective","date":"2023-04-28","tags":"100DaysToOffload, infrastructure, aws, note, terraform, learnings, devops, serverless, tech"},"tags":["100DaysToOffload","infrastructure","aws","note","terraform","learnings","devops","serverless","tech"]},"recommendedPosts":[{"slug":"2026-02-13-n8n-nodes-open5e-n8n-community-node-that-lets-you-access-d-d-5th-edition-srd-content","frontmatter":{"title":"n8n-nodes-open5e: n8n community node that lets you access D&D 5th edition SRD content","date":"2026-02-13","tags":"note, tech, programming, n8n, automation, ttrpg"},"tags":["note","tech","programming","n8n","automation","ttrpg"]},{"slug":"2026-02-11-on-seeking-order-in-chaos","frontmatter":{"title":"On Seeking Order in Chaos","date":"2026-02-11","tags":"note, learnings, life"},"tags":["note","learnings","life"]},{"slug":"2026-02-04-a-fix-for-long-pressing-movement-keys-in-vscode-with-vim-mode","frontmatter":{"title":"A fix for long-pressing movement keys in VSCode with Vim-Mode","date":"2026-02-04","tags":"guide, note, editors, tech, programming, vim"},"tags":["guide","note","editors","tech","programming","vim"]},{"slug":"2025-12-11-custom-entities-in-home-assistant","frontmatter":{"title":"Custom Entities in Home Assistant","date":"2025-12-11","tags":"guide, note, homeassistant, homelab, tech, programming"},"tags":["guide","note","homeassistant","homelab","tech","programming"]},{"slug":"2025-09-15-making-family-it-support-effortless-and-free","frontmatter":{"title":"Making family IT support effortless (and free)","date":"2025-09-15","tags":"note, life, tech"},"tags":["note","life","tech"]}]},"__N_SSG":true}