{"pageProps":{"post":{"slug":"2024-04-10-beating-elden-ring","markdownBody":"\n> **⚠️ WARNING ⚠️**: This post contains a lot of spoilers for the game Elden Ring.\r\n\r\nSo, I just beat Elden Ring. It took me 120 hours and, coincidentally, I was level 120 when I beat the final boss. That damn final boss... but more on that later.\r\n\r\nElden Ring won me over instantly, even though I've never played any of the other Souls games. After beating [Breath of the Wild](https://de.wikipedia.org/wiki/The_Legend_of_Zelda:_Breath_of_the_Wild), I called it my favorite game. I just needed more games like this. When Elden Ring came out, people compared The Lands Between to the open world of Hyrule, and I quickly agreed. The freedom these games give you is absolutely unbeaten. You almost never really get \"stuck\" on something. You can always wonder off and explore until you're ready to take on the fight.\r\n\r\nAfter about 50 hours into playing Elden Ring, I kind of lost my focus and stopped playing for a while. It was too huge of a game to beat at the time, so I gave up.\r\n\r\nBut then, [Tears of the Kingdom](https://de.wikipedia.org/wiki/The_Legend_of_Zelda:_Tears_of_the_Kingdom) came out and doubled up on the world of Hyrule. I absolutely adored this game. I spent day and night playing until I finally beat it. This game also motivated me to beat Elden Ring one more time. Despite failing over and over, each play session gave me a feeling of progression. I might not have beaten a boss yet, but there was always something happening the side that got me closer to beating it. Be it exploring and getting better gear or learning as much as I can about a boss to find ways to deal damange, I always got a small step closer to my goal. I'd go as far as to say I never felt so determined to reach a goal ever before in my life.\r\n\r\nThe boss fights in Elden Ring are obviously extremely difficult, but they're always fair. The bosses in this game never make mistakes, you're the one that screwed up. You just keep failing and failing, but with each run, you learn something new about the fight that makes it easier in the next run. And when you finally overcoming this challenge gives you a feeling of accomplishment like nothing else could.\r\n\r\nWhat I didn't realize in the beginning of my playthough is how extremely well rounded the world and the lore of this game is. I spent days and nights indulging myself in the lore through numerous YouTube videos, guides and Wikis. Only then did I begin to understand the scale of this game. Every action of each character, every building and every item fits in the grand scheme of the world.\r\n\r\nGoing out of this, the biggest thing that stuck with me is the determination. Failing is part of your life, and that is okay. No matter how daunting a task is, there's **always** a way to overcome it. The Elden Beast is the final boss of the game, and it's also where I spent about a quarter of my playtime. This thing has absurd attacks, immense health, and did I mention that you have to beat it after beating another extremely difficult boss, without being able to top up your health? This fight is ridiculous. I spent multiple weeks trying to beat it. I was really close to giving up, but as I mentioned earlier, each run gets you a tiny bit closer to the finish line, so I pushed through. I refined my build, I leveled up my stats and I learned how to dance with the beast. Eventually, I won the fight not by luck, but by determination. I now feel like I understand every attack well enough to dodge it. My mind was on autopilot when I beat it.\r\n\r\nKnowing this much about a game didn't teach me any practical skills. There's nothing I can do now that I couldn't do before I knew that Rykard (Lord of Blasphemy), son of Rennala and Radagon (also known as Queen Marika), chose to go against the Erdtree and eventually fed himself to a serpent to devour the entire world (which you prevented). But there's something about this game that left me craving for more. It's truly a masterpiece.\r\n\r\n## Bonus\r\n\r\nIn case you're interested, I uploaded some of the bossfights during my playthrough in this YouTube playlist:\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/videoseries?si=j1Ue2lrrLy1JTOM9&amp;list=PLS8TKBZz1x5S6ojf24SMF1h_HYb4AyTxc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n","frontmatter":{"title":"Beating Elden Ring","date":"2024-04-10","tags":"note, learnings, life, review, gaming"},"tags":["note","learnings","life","review","gaming"]},"recommendedPosts":[{"slug":"2024-06-27-testing-smtp-connections","frontmatter":{"title":"Testing SMTP connections","date":"2024-06-27","tags":"infrastructure, guide, note, learnings, tech"},"tags":["infrastructure","guide","note","learnings","tech"]},{"slug":"2024-05-24-going-from-self-hosted-to-managed-software","frontmatter":{"title":"Going from self hosted to managed software","date":"2024-05-24","tags":"infrastructure, note, learnings, opinion, homelab, tech"},"tags":["infrastructure","note","learnings","opinion","homelab","tech"]},{"slug":"2024-05-10-about-my-smart-g-shock","frontmatter":{"title":"About my 'smart' G-Shock","date":"2024-05-10","tags":"note, life, review, watches"},"tags":["note","life","review","watches"]},{"slug":"2024-05-08-i-sold-my-car","frontmatter":{"title":"I sold my car","date":"2024-05-08","tags":"note, life"},"tags":["note","life"]},{"slug":"2024-04-15-beware-of-base64-encoded-strings","frontmatter":{"title":"Beware of base64 encoded strings","date":"2024-04-15","tags":"guide, note, learnings, web, til, tech, programming"},"tags":["guide","note","learnings","web","til","tech","programming"]}]},"__N_SSG":true}