{"pageProps":{"post":{"slug":"2022-05-06-weeknote-18-2022","markdownBody":"\nIt's friday, my dudes! Here are some notes on what happened during my week.\n\n## At Work\n\nI wanted to start off my week by looking into migrating our deployment workflow\nto a GitLab Agent, as described [last week](/posts/2022-04-29-weeknote-17-2022).\nThat didn't really go well, since a database from another project bursted into\nflames (not literally) for a reason I still couldn't figure out. As a\nworkaround, I just beefed up the AWS RDS instance size until we find a proper\nsolution.\n\nWhile looking through the docs, I also read more about [Aurora\nServerless](https://aws.amazon.com/de/rds/aurora/serverless/), which would be a\nmatch made in heaven, at least for this specific project. Instead of keeping\nmultiple instances running even without any load, serverless automatically\nscales to as many resources as you need. This **drastically** improves\nperformance (according to the docs it's instantaneous, but I'll have to see that\nwith my own eyes), while keeping the price at a minimum. Once we're done with\nthat migration, I'll probably follow up with a blog post on this.\n\n## Home Automation\n\nWe recently wanted to configure a light in our bedroom to turn on early and the\nmorning, stay on for a few hours and then turn off. Same for the evening.\n\nSoo, I ordered two power plugs pre-flashed with\n[Tasmota](https://tasmota.github.io/docs/) and yanked HomeAssistant onto an old\nPi. The plugs came as a pair, so I automated another light in our home. I think\nthis will be the beginning of a deep deep rabbit hole.\n\nWe'll be moving to a new flat soon, where humidity is higher than usual. I'm\nthinking to monitor this and react with some counter-measures, like air filters.\nSky is the limit, really. More to follow...\n\n## Motorbike Maintenance\n\nI was long due to dust off my motorbike, but I finally did. Also, I did my first\noil change on a vehicle **ever**!\n\n![Motorbike oil change](/assets/posts/2022-05-06-weeknote-18-2022/motorbike_oil_change.jpeg)\n\nFeels great to finally be back on the road.\n\n## Fun Fun Fun\n\nBesides riding my motorbike, we went to a fair in our town. It was the first\ntime in years that I've been to a fair, and to ride bumper cars.\n\nAlso, I met up with a friend I haven't seen in a while. It was great taking a\nwalk and talking about life.\n\nThat's it for this week. Thanks for reading!\n\nThis is post 030 of [#100DaysToOffload](https://100daystooffload.com/).\n","frontmatter":{"title":"Weeknote 18/2022","date":"2022-05-06","tags":"weeknote, 100DaysToOffload"},"tags":["weeknote","100DaysToOffload"]},"recommendedPosts":[{"slug":"2022-04-29-weeknote-17-2022","frontmatter":{"title":"Weeknote 17/2022","date":"2022-04-29","tags":"weeknote, 100DaysToOffload"},"tags":["weeknote","100DaysToOffload"]},{"slug":"2022-04-25-weeknote-16-2022","frontmatter":{"title":"Weeknote 16/2022","date":"2022-04-25","tags":"weeknote, 100DaysToOffload"},"tags":["weeknote","100DaysToOffload"]}]},"__N_SSG":true}